# コメントについて
# python は命令を見るとそれを解釈して実行しますが、コメントは実行対象外として認識されます。
# コメントはシャープ記号から始まり行末で終わります。
# 行頭にシャープ記号を置くとその行全部がコメントになります。

# コメントの用途
# コメントは、この文章のようにプログラムを読む人のために情報を共有したり、
# print('テスト') 
# のように一時的に命令を無効化するために利用します。
print('emacs でこのファイルを開いて中の指示に従って下さい。') # 先程実行されたのはこの行です。

# 課題
# 指示に従ってこのファイルを編集してください。
# 課題の文章より上の命令の部分をすべてコメント化し、実行できないようにしてください。
# 以下の2行の行頭のシャープ記号を2つとも削除して命令を有効化してください。
#import datetime
#print(datetime.datetime.now())
# 編集が終わったら保存してファイルを閉じて下さい。
# 編集したb401.pyをpython で実行してください。
# python b401.py
# 日時のみが出力されれば正しく課題ができています。

# 正しく課題ができているのを自分で確認したら、次のコマンドを実行してください。
# python b401.py > b401.txt
# python b401.pyの実行結果をテキストファイル b401.txt に保存します。
# > の部分を「リダイレクト」といいます。
# b401.txtが作成できたらb401.txtとb401.pyの両方のファイルを提出してください。

