import random
seiseki = random.randint(-1,100)
year = random.randint(0,3000)

# 問(ii) 成績判定プログラムを作成してください。
#        seiseki の値に応じて、下の表の通りにアルファベット部分を表示させてください。
#           -1 :"K",
#         0~59 :"D",
#        60~69 :"C",
#        70~79 :"B",
#        80~89 :"A",
#        90~100:"AA"
print('(ii)')
print("Seiseki:",seiseki)

# 問(iii) year を西暦と見立てて、
#         うるう年のとき   "a leap year"
#         そうでないときは "a common year"
#         と表示するプログラムを作成してください。
#         うるう年とは西暦が4で割り切れる年です。
#         ただし、西暦が100で割り切れるが400で割り切れない年は平年とします。
#         例：
#           2000年はうるう年です。
#           2019年は平年です。
#           2020年はうるう年です。
#           2100年は平年です。 
print('(iii)')
print("Year:",year)

#============================================================================
# 完成したプログラム b702.py とその出力結果 b702.txt を提出してください。
#============================================================================

